bookers2-debug/app/controllers/users_controller.rb

  def index
  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。
---
SELECT "users".* FROM "users"

  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "a17cbb0b74fe1c462e624ae599533ec5bd514273399cb4b6b4ed5ed680af"], ["updated_at", "2019-12-24 09:48:07.760046"], ["id", 2]]