bookers2-kadai3/app/views/books/index.html.erb

                            <%= link_to book_favorites_path(book), method: :delete do %>
                            <span class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"><%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

                            <%= link_to book_favorites_path(book), method: :post do %>
                             <span class="glyphicon glyphicon-heart" aria-hidden="true" ><%= book.favorites.count %></span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

                        <td>
                            <%= "コメント数:#{book.book_comments.count}" %>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]