bookers2-kadai3/app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
                        <span class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;">
                            <%= @book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
                        <span class="glyphicon glyphicon-heart" aria-hidden="true">
                            <%= @book.favorites.count %></span>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
                    <td>
                        <%= "コメント数:#{@book.book_comments.count}" %>

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 2]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
            <div>
                <% @book.book_comments.each do |book_comment| %>